presentations/013-ai-react-development.org
#+TITLE: AI-Assisted React Development
#+SUBTITLE: React Paris Meetup #013 - WIP
#+AUTHOR: React Paris Community
#+DATE: 2025
#+OPTIONS: toc:nil num:nil reveal_single_file:t
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_THEME: solarized
#+REVEAL_TRANS: convex
#+REVEAL_PLUGINS: (highlight notes)
#+REVEAL_EXTRA_CSS:
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h4>%s</h4><p>%a</p><p><small>%d</small></p>
#+REVEAL_HIGHLIGHT_CSS: https://cdn.jsdelivr.net/npm/highlight.js/styles/solarized-light.min.css

* The AI Revolution in Development
:PROPERTIES:
:reveal_background: #fdf6e3
:END:

** A New Era

#+BEGIN_QUOTE
"AI won't replace developers, but developers using AI will replace those who don't."
#+END_QUOTE

#+ATTR_REVEAL: :frag (appear)
- Code generation is just the beginning
- AI assists at every stage of development
- The skill is knowing how to collaborate with AI
- Understanding limitations is crucial

** What We'll Explore

#+ATTR_REVEAL: :frag (appear)
1. AI coding assistants (Copilot, Claude, etc.)
2. AI-powered component generation
3. Building AI features in React apps
4. Streaming responses with Suspense
5. Best practices and limitations

* Part 1: AI Coding Assistants
:PROPERTIES:
:reveal_background: #eee8d5
:END:

** The Landscape in 2025

*** Major Players

| Tool            | Strength              | Integration           |
|-----------------+-----------------------+-----------------------|
| GitHub Copilot  | Inline completions    | VS Code, JetBrains    |
| Claude          | Complex reasoning     | API, Claude Code      |
| Cursor          | Codebase-aware        | Standalone IDE        |
| Codeium         | Free tier             | Multiple IDEs         |
| Amazon Q        | AWS integration       | VS Code, CLI          |

** Effective Prompting for React

*** Be Specific

#+BEGIN_SRC text
// BAD prompt:
"Make a form"

// GOOD prompt:
"Create a React form component with:
- Email and password fields
- Client-side validation using zod
- useActionState for submission
- Loading state during submit
- Error display below each field
- Accessible labels and aria attributes"
#+END_SRC

** Context is King

*** Provide Examples

#+BEGIN_SRC text
// In your prompt or comments:
// Follow the pattern from UserForm.tsx
// Use our Button and Input components from @/components/ui
// Handle errors like we do in ContactForm
// Match the styling in forms.css

// Then ask:
"Create a newsletter subscription form following
 our existing patterns"
#+END_SRC

** What AI Does Well

#+ATTR_REVEAL: :frag (appear)
- Boilerplate generation
- Pattern recognition and application
- API documentation lookup
- Converting between formats (JS to TS, etc.)
- Writing tests for existing code
- Explaining complex code

** What AI Struggles With

#+ATTR_REVEAL: :frag (appear)
- Novel architectural decisions
- Complex state management
- Performance optimization (needs profiling data)
- Security-critical code (always review!)
- Understanding full system context
- Keeping up with latest API changes

* Part 2: AI Component Generation
:PROPERTIES:
:reveal_background: #fdf6e3
:END:

** v0.dev: Design to Code

*** From Description to Component

#+BEGIN_SRC text
Prompt: "A pricing table with three tiers:
Basic ($9/mo), Pro ($29/mo), Enterprise (custom).
Each has feature list, CTA button.
Pro tier highlighted as recommended."
#+END_SRC

v0 generates:
- Complete React component
- Tailwind CSS styling
- Responsive design
- Basic accessibility

** Generated Code Review

*** Always Verify

#+BEGIN_SRC jsx
// v0 might generate:
<div onClick={handleSelect}>  // [!] Not keyboard accessible

// Should be:
<button onClick={handleSelect}>

// Or with proper ARIA:
<div
  role="button"
  tabIndex={0}
  onClick={handleSelect}
  onKeyDown={(e) => {
    if (e.key === 'Enter' || e.key === ' ') {
      handleSelect();
    }
  }}
>
#+END_SRC

** Integration Workflow

*** From v0 to Production

#+BEGIN_SRC text
1. Generate initial component in v0
2. Copy to your codebase
3. Replace generic styles with design tokens
4. Add proper TypeScript types
5. Implement actual business logic
6. Add accessibility attributes
7. Write tests
8. Document in Storybook
#+END_SRC

* Part 3: Building AI Features in React
:PROPERTIES:
:reveal_background: #eee8d5
:END:

** The Vercel AI SDK

*** Quick Setup

#+BEGIN_SRC bash
npm install ai @ai-sdk/openai
#+END_SRC

#+BEGIN_SRC jsx
// app/api/chat/route.ts
import { openai } from '@ai-sdk/openai';
import { streamText } from 'ai';

export async function POST(req: Request) {
  const { messages } = await req.json();

  const result = streamText({
    model: openai('gpt-4-turbo'),
    messages
  });

  return result.toDataStreamResponse();
}
#+END_SRC

** Chat Interface Component

*** useChat Hook

#+BEGIN_SRC jsx
'use client';
import { useChat } from 'ai/react';

export function ChatInterface() {
  const { messages, input, handleInputChange, handleSubmit, isLoading } =
    useChat();

  return (
    <div className="flex flex-col h-screen">
      <div className="flex-1 overflow-y-auto p-4">
        {messages.map((m) => (
          <div key={m.id} className={m.role === 'user' ? 'text-right' : ''}>
            <span className="font-bold">
              {m.role === 'user' ? 'You' : 'AI'}:
            </span>
            <p>{m.content}</p>
          </div>
        ))}
      </div>
      <form onSubmit={handleSubmit} className="p-4 border-t">
        <input
          value={input}
          onChange={handleInputChange}
          placeholder="Ask something..."
          disabled={isLoading}
        />
      </form>
    </div>
  );
}
#+END_SRC

