presentations/013-ai-react-development.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-13 Sat 20:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AI-Assisted React Development</title>
<meta name="author" content="React Paris Community" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">AI-Assisted React Development
<br />
<span class="subtitle">React Paris Meetup #013 - WIP</span>
</h1>
<div id="outline-container-org1131fad" class="outline-2">
<h2 id="org1131fad">The AI Revolution in Development</h2>
<div class="outline-text-2" id="text-org1131fad">
</div>
<div id="outline-container-orgdf696a2" class="outline-3">
<h3 id="orgdf696a2">A New Era</h3>
<div class="outline-text-3" id="text-orgdf696a2">
<blockquote>
<p>
"AI won't replace developers, but developers using AI will replace those who don't."
</p>
</blockquote>

<ul class="org-ul">
<li>Code generation is just the beginning</li>
<li>AI assists at every stage of development</li>
<li>The skill is knowing how to collaborate with AI</li>
<li>Understanding limitations is crucial</li>
</ul>
</div>
</div>
<div id="outline-container-org43c3589" class="outline-3">
<h3 id="org43c3589">What We'll Explore</h3>
<div class="outline-text-3" id="text-org43c3589">
<ol class="org-ol">
<li>AI coding assistants (Copilot, Claude, etc.)</li>
<li>AI-powered component generation</li>
<li>Building AI features in React apps</li>
<li>Streaming responses with Suspense</li>
<li>Best practices and limitations</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org8585b9e" class="outline-2">
<h2 id="org8585b9e">Part 1: AI Coding Assistants</h2>
<div class="outline-text-2" id="text-org8585b9e">
</div>
<div id="outline-container-orgb4a275b" class="outline-3">
<h3 id="orgb4a275b">The Landscape in 2025</h3>
<div class="outline-text-3" id="text-orgb4a275b">
</div>
<div id="outline-container-org8140e93" class="outline-4">
<h4 id="org8140e93">Major Players</h4>
<div class="outline-text-4" id="text-org8140e93">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tool</th>
<th scope="col" class="org-left">Strength</th>
<th scope="col" class="org-left">Integration</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GitHub Copilot</td>
<td class="org-left">Inline completions</td>
<td class="org-left">VS Code, JetBrains</td>
</tr>

<tr>
<td class="org-left">Claude</td>
<td class="org-left">Complex reasoning</td>
<td class="org-left">API, Claude Code</td>
</tr>

<tr>
<td class="org-left">Cursor</td>
<td class="org-left">Codebase-aware</td>
<td class="org-left">Standalone IDE</td>
</tr>

<tr>
<td class="org-left">Codeium</td>
<td class="org-left">Free tier</td>
<td class="org-left">Multiple IDEs</td>
</tr>

<tr>
<td class="org-left">Amazon Q</td>
<td class="org-left">AWS integration</td>
<td class="org-left">VS Code, CLI</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org7dd4c84" class="outline-3">
<h3 id="org7dd4c84">Effective Prompting for React</h3>
<div class="outline-text-3" id="text-org7dd4c84">
</div>
<div id="outline-container-orga155841" class="outline-4">
<h4 id="orga155841">Be Specific</h4>
<div class="outline-text-4" id="text-orga155841">
<div class="org-src-container">
<pre class="src src-text">// BAD prompt:
"Make a form"

// GOOD prompt:
"Create a React form component with:
- Email and password fields
- Client-side validation using zod
- useActionState for submission
- Loading state during submit
- Error display below each field
- Accessible labels and aria attributes"
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc81e1f2" class="outline-3">
<h3 id="orgc81e1f2">Context is King</h3>
<div class="outline-text-3" id="text-orgc81e1f2">
</div>
<div id="outline-container-orgea01f49" class="outline-4">
<h4 id="orgea01f49">Provide Examples</h4>
<div class="outline-text-4" id="text-orgea01f49">
<div class="org-src-container">
<pre class="src src-text">// In your prompt or comments:
// Follow the pattern from UserForm.tsx
// Use our Button and Input components from @/components/ui
// Handle errors like we do in ContactForm
// Match the styling in forms.css

// Then ask:
"Create a newsletter subscription form following
 our existing patterns"
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge9c9d99" class="outline-3">
<h3 id="orge9c9d99">What AI Does Well</h3>
<div class="outline-text-3" id="text-orge9c9d99">
<ul class="org-ul">
<li>Boilerplate generation</li>
<li>Pattern recognition and application</li>
<li>API documentation lookup</li>
<li>Converting between formats (JS to TS, etc.)</li>
<li>Writing tests for existing code</li>
<li>Explaining complex code</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc185d2" class="outline-3">
<h3 id="orgfc185d2">What AI Struggles With</h3>
<div class="outline-text-3" id="text-orgfc185d2">
<ul class="org-ul">
<li>Novel architectural decisions</li>
<li>Complex state management</li>
<li>Performance optimization (needs profiling data)</li>
<li>Security-critical code (always review!)</li>
<li>Understanding full system context</li>
<li>Keeping up with latest API changes</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7acbf87" class="outline-2">
<h2 id="org7acbf87">Part 2: AI Component Generation</h2>
<div class="outline-text-2" id="text-org7acbf87">
</div>
<div id="outline-container-orgef89de7" class="outline-3">
<h3 id="orgef89de7">v0.dev: Design to Code</h3>
<div class="outline-text-3" id="text-orgef89de7">
</div>
<div id="outline-container-org6e335db" class="outline-4">
<h4 id="org6e335db">From Description to Component</h4>
<div class="outline-text-4" id="text-org6e335db">
<div class="org-src-container">
<pre class="src src-text">Prompt: "A pricing table with three tiers:
Basic ($9/mo), Pro ($29/mo), Enterprise (custom).
Each has feature list, CTA button.
Pro tier highlighted as recommended."
</pre>
</div>

<p>
v0 generates:
</p>
<ul class="org-ul">
<li>Complete React component</li>
<li>Tailwind CSS styling</li>
<li>Responsive design</li>
<li>Basic accessibility</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org90b1685" class="outline-3">
<h3 id="org90b1685">Generated Code Review</h3>
<div class="outline-text-3" id="text-org90b1685">
</div>
<div id="outline-container-org801a733" class="outline-4">
<h4 id="org801a733">Always Verify</h4>
<div class="outline-text-4" id="text-org801a733">
<div class="org-src-container">
<pre class="src src-jsx">// v0 might generate:
&lt;div onClick={handleSelect}&gt;  // [!] Not keyboard accessible

// Should be:
&lt;button onClick={handleSelect}&gt;

// Or with proper ARIA:
&lt;div
  role="button"
  tabIndex={0}
  onClick={handleSelect}
  onKeyDown={(e) =&gt; {
    if (e.key === 'Enter' || e.key === ' ') {
      handleSelect();
    }
  }}
&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org91fe7ac" class="outline-3">
<h3 id="org91fe7ac">Integration Workflow</h3>
<div class="outline-text-3" id="text-org91fe7ac">
</div>
<div id="outline-container-org6eef470" class="outline-4">
<h4 id="org6eef470">From v0 to Production</h4>
<div class="outline-text-4" id="text-org6eef470">
<div class="org-src-container">
<pre class="src src-text">1. Generate initial component in v0
2. Copy to your codebase
3. Replace generic styles with design tokens
4. Add proper TypeScript types
5. Implement actual business logic
6. Add accessibility attributes
7. Write tests
8. Document in Storybook
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfe839b2" class="outline-2">
<h2 id="orgfe839b2">Part 3: Building AI Features in React</h2>
<div class="outline-text-2" id="text-orgfe839b2">
</div>
<div id="outline-container-org0de83f3" class="outline-3">
<h3 id="org0de83f3">The Vercel AI SDK</h3>
<div class="outline-text-3" id="text-org0de83f3">
</div>
<div id="outline-container-org9fdf719" class="outline-4">
<h4 id="org9fdf719">Quick Setup</h4>
<div class="outline-text-4" id="text-org9fdf719">
<div class="org-src-container">
<pre class="src src-bash">npm install ai @ai-sdk/openai
</pre>
</div>

<div class="org-src-container">
<pre class="src src-jsx">// app/api/chat/route.ts
import { openai } from '@ai-sdk/openai';
import { streamText } from 'ai';

export async function POST(req: Request) {
  const { messages } = await req.json();

  const result = streamText({
    model: openai('gpt-4-turbo'),
    messages
  });

  return result.toDataStreamResponse();
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0e096b5" class="outline-3">
<h3 id="org0e096b5">Chat Interface Component</h3>
<div class="outline-text-3" id="text-org0e096b5">
</div>
<div id="outline-container-org029d269" class="outline-4">
<h4 id="org029d269">useChat Hook</h4>
<div class="outline-text-4" id="text-org029d269">
<div class="org-src-container">
<pre class="src src-jsx">'use client';
import { useChat } from 'ai/react';

export function ChatInterface() {
  const { messages, input, handleInputChange, handleSubmit, isLoading } =
    useChat();

  return (
    &lt;div className="flex flex-col h-screen"&gt;
      &lt;div className="flex-1 overflow-y-auto p-4"&gt;
        {messages.map((m) =&gt; (
          &lt;div key={m.id} className={m.role === 'user' ? 'text-right' : ''}&gt;
            &lt;span className="font-bold"&gt;
              {m.role === 'user' ? 'You' : 'AI'}:
            &lt;/span&gt;
            &lt;p&gt;{m.content}&lt;/p&gt;
          &lt;/div&gt;
        ))}
      &lt;/div&gt;
      &lt;form onSubmit={handleSubmit} className="p-4 border-t"&gt;
        &lt;input
          value={input}
          onChange={handleInputChange}
          placeholder="Ask something..."
          disabled={isLoading}
        /&gt;
      &lt;/form&gt;
    &lt;/div&gt;
  );
}
</pre>
</div>
</div>
</div>
</div>
