presentations/013-ai-react-development.org
** Streaming with Suspense

*** Progressive UI Updates

#+BEGIN_SRC jsx
'use client';
import { useCompletion } from 'ai/react';

function StreamingDemo() {
  const { completion, input, handleInputChange, handleSubmit, isLoading } =
    useCompletion({
      api: '/api/completion'
    });

  return (
    <div>
      <form onSubmit={handleSubmit}>
        <textarea
          value={input}
          onChange={handleInputChange}
          placeholder="Enter a topic..."
        />
        <button type="submit" disabled={isLoading}>
          Generate
        </button>
      </form>

      {/* Streams in real-time */}
      <div className="prose">
        {completion}
        {isLoading && <span className="animate-pulse">|</span>}
      </div>
    </div>
  );
}
#+END_SRC

* Part 4: Advanced Patterns
:PROPERTIES:
:reveal_background: #fdf6e3
:END:

** Structured Output

*** JSON Mode with Zod

#+BEGIN_SRC jsx
import { generateObject } from 'ai';
import { z } from 'zod';

const recipeSchema = z.object({
  name: z.string(),
  ingredients: z.array(z.object({
    item: z.string(),
    amount: z.string()
  })),
  steps: z.array(z.string()),
  prepTime: z.number(),
  difficulty: z.enum(['easy', 'medium', 'hard'])
});

const { object: recipe } = await generateObject({
  model: openai('gpt-4-turbo'),
  schema: recipeSchema,
  prompt: 'Generate a recipe for chocolate chip cookies'
});

// recipe is fully typed!
console.log(recipe.ingredients[0].item);
#+END_SRC

** Tool Use / Function Calling

*** AI with Actions

#+BEGIN_SRC jsx
import { streamText, tool } from 'ai';
import { z } from 'zod';

const result = streamText({
  model: openai('gpt-4-turbo'),
  messages,
  tools: {
    getWeather: tool({
      description: 'Get current weather for a location',
      parameters: z.object({
        location: z.string().describe('City name')
      }),
      execute: async ({ location }) => {
        const weather = await fetchWeatherAPI(location);
        return weather;
      }
    }),
    searchProducts: tool({
      description: 'Search product catalog',
      parameters: z.object({
        query: z.string(),
        maxPrice: z.number().optional()
      }),
      execute: async ({ query, maxPrice }) => {
        return await searchCatalog(query, maxPrice);
      }
    })
  }
});
#+END_SRC

** RAG: Retrieval Augmented Generation

*** Grounding AI in Your Data

#+BEGIN_SRC text
User Query
    |
    v
+-------------------+
| Embedding Model   |  Convert to vector
+-------------------+
    |
    v
+-------------------+
| Vector Database   |  Find similar docs
| (Pinecone, etc.)  |
+-------------------+
    |
    v
+-------------------+
| LLM with Context  |  Answer with sources
+-------------------+
    |
    v
Response with citations
#+END_SRC

** RAG Implementation

*** Vector Search + Generation

#+BEGIN_SRC jsx
async function ragQuery(question: string) {
  // 1. Create embedding of question
  const embedding = await createEmbedding(question);

  // 2. Search vector database
  const relevantDocs = await vectorDB.search({
    vector: embedding,
    topK: 5
  });

  // 3. Generate answer with context
  const response = await generateText({
    model: openai('gpt-4-turbo'),
    prompt: `Answer based on these documents:

${relevantDocs.map(d => d.content).join('\n\n')}

Question: ${question}`
  });

  return {
    answer: response.text,
    sources: relevantDocs.map(d => d.metadata.url)
  };
}
#+END_SRC

* Part 5: Error Handling and UX
:PROPERTIES:
:reveal_background: #eee8d5
:END:

** Rate Limiting

*** Protecting Your API

#+BEGIN_SRC jsx
import { Ratelimit } from '@upstash/ratelimit';
import { Redis } from '@upstash/redis';

const ratelimit = new Ratelimit({
  redis: Redis.fromEnv(),
  limiter: Ratelimit.slidingWindow(10, '1 m') // 10 per minute
});

export async function POST(req: Request) {
  const ip = req.headers.get('x-forwarded-for') ?? 'anonymous';
  const { success, remaining } = await ratelimit.limit(ip);

  if (!success) {
    return new Response('Rate limited', {
      status: 429,
      headers: { 'X-RateLimit-Remaining': remaining.toString() }
    });
  }

  // Process AI request...
}
#+END_SRC

** Graceful Degradation

*** Handling Failures

#+BEGIN_SRC jsx
function AIFeature() {
  const { error, isLoading, retry } = useChat({
    onError: (err) => {
      // Log to monitoring
      captureException(err);
    }
  });

  if (error) {
    return (
      <div className="bg-yellow-50 p-4 rounded">
        <p>AI is temporarily unavailable.</p>
        <button onClick={retry}>Try again</button>
        <p className="text-sm mt-2">
          You can still use the app manually.
        </p>
      </div>
    );
  }

  // Normal render...
}
#+END_SRC

** Cost Optimization

*** Strategies

#+ATTR_REVEAL: :frag (appear)
- Cache common queries
- Use smaller models for simple tasks
- Implement token budgets per user
- Stream responses (better UX, no change in cost)
- Batch requests where possible
- Monitor usage with observability tools

* Part 6: Responsible AI Integration
:PROPERTIES:
:reveal_background: #fdf6e3
:END:

** Content Moderation

*** Filtering Harmful Content

#+BEGIN_SRC jsx
import { generateText } from 'ai';
import { openai } from '@ai-sdk/openai';

async function moderatedGeneration(prompt: string) {
  // Pre-check user input
  const moderation = await openai.moderations.create({
    input: prompt
  });

  if (moderation.results[0].flagged) {
    throw new Error('Content policy violation');
  }

  // Safe to proceed
  const response = await generateText({
    model: openai('gpt-4-turbo'),
    prompt,
    // Also set system prompt for safety
    system: `You are a helpful assistant. Never provide
             harmful, illegal, or inappropriate content.`
  });

  return response;
}
#+END_SRC

** Transparency with Users

*** Best Practices

#+ATTR_REVEAL: :frag (appear)
- Clearly label AI-generated content
- Show confidence levels when appropriate
- Allow users to provide feedback
- Explain what data is used
- Provide opt-out options
- Document AI limitations

