presentations/013-ai-react-development.html
<div id="outline-container-org811769d" class="outline-3">
<h3 id="org811769d">Streaming with Suspense</h3>
<div class="outline-text-3" id="text-org811769d">
</div>
<div id="outline-container-org103e8f8" class="outline-4">
<h4 id="org103e8f8">Progressive UI Updates</h4>
<div class="outline-text-4" id="text-org103e8f8">
<div class="org-src-container">
<pre class="src src-jsx">'use client';
import { useCompletion } from 'ai/react';

function StreamingDemo() {
  const { completion, input, handleInputChange, handleSubmit, isLoading } =
    useCompletion({
      api: '/api/completion'
    });

  return (
    &lt;div&gt;
      &lt;form onSubmit={handleSubmit}&gt;
        &lt;textarea
          value={input}
          onChange={handleInputChange}
          placeholder="Enter a topic..."
        /&gt;
        &lt;button type="submit" disabled={isLoading}&gt;
          Generate
        &lt;/button&gt;
      &lt;/form&gt;

      {/* Streams in real-time */}
      &lt;div className="prose"&gt;
        {completion}
        {isLoading &amp;&amp; &lt;span className="animate-pulse"&gt;|&lt;/span&gt;}
      &lt;/div&gt;
    &lt;/div&gt;
  );
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orge990dec" class="outline-2">
<h2 id="orge990dec">Part 4: Advanced Patterns</h2>
<div class="outline-text-2" id="text-orge990dec">
</div>
<div id="outline-container-org63df5aa" class="outline-3">
<h3 id="org63df5aa">Structured Output</h3>
<div class="outline-text-3" id="text-org63df5aa">
</div>
<div id="outline-container-orgd3c0756" class="outline-4">
<h4 id="orgd3c0756">JSON Mode with Zod</h4>
<div class="outline-text-4" id="text-orgd3c0756">
<div class="org-src-container">
<pre class="src src-jsx">import { generateObject } from 'ai';
import { z } from 'zod';

const recipeSchema = z.object({
  name: z.string(),
  ingredients: z.array(z.object({
    item: z.string(),
    amount: z.string()
  })),
  steps: z.array(z.string()),
  prepTime: z.number(),
  difficulty: z.enum(['easy', 'medium', 'hard'])
});

const { object: recipe } = await generateObject({
  model: openai('gpt-4-turbo'),
  schema: recipeSchema,
  prompt: 'Generate a recipe for chocolate chip cookies'
});

// recipe is fully typed!
console.log(recipe.ingredients[0].item);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org56db25a" class="outline-3">
<h3 id="org56db25a">Tool Use / Function Calling</h3>
<div class="outline-text-3" id="text-org56db25a">
</div>
<div id="outline-container-orga0aa9f6" class="outline-4">
<h4 id="orga0aa9f6">AI with Actions</h4>
<div class="outline-text-4" id="text-orga0aa9f6">
<div class="org-src-container">
<pre class="src src-jsx">import { streamText, tool } from 'ai';
import { z } from 'zod';

const result = streamText({
  model: openai('gpt-4-turbo'),
  messages,
  tools: {
    getWeather: tool({
      description: 'Get current weather for a location',
      parameters: z.object({
        location: z.string().describe('City name')
      }),
      execute: async ({ location }) =&gt; {
        const weather = await fetchWeatherAPI(location);
        return weather;
      }
    }),
    searchProducts: tool({
      description: 'Search product catalog',
      parameters: z.object({
        query: z.string(),
        maxPrice: z.number().optional()
      }),
      execute: async ({ query, maxPrice }) =&gt; {
        return await searchCatalog(query, maxPrice);
      }
    })
  }
});
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd575b4e" class="outline-3">
<h3 id="orgd575b4e">RAG: Retrieval Augmented Generation</h3>
<div class="outline-text-3" id="text-orgd575b4e">
</div>
<div id="outline-container-orgfb3edc6" class="outline-4">
<h4 id="orgfb3edc6">Grounding AI in Your Data</h4>
<div class="outline-text-4" id="text-orgfb3edc6">
<div class="org-src-container">
<pre class="src src-text">User Query
    |
    v
+-------------------+
| Embedding Model   |  Convert to vector
+-------------------+
    |
    v
+-------------------+
| Vector Database   |  Find similar docs
| (Pinecone, etc.)  |
+-------------------+
    |
    v
+-------------------+
| LLM with Context  |  Answer with sources
+-------------------+
    |
    v
Response with citations
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org6371ae0" class="outline-3">
<h3 id="org6371ae0">RAG Implementation</h3>
<div class="outline-text-3" id="text-org6371ae0">
</div>
<div id="outline-container-orgf2546d8" class="outline-4">
<h4 id="orgf2546d8">Vector Search + Generation</h4>
<div class="outline-text-4" id="text-orgf2546d8">
<div class="org-src-container">
<pre class="src src-jsx">async function ragQuery(question: string) {
  // 1. Create embedding of question
  const embedding = await createEmbedding(question);

  // 2. Search vector database
  const relevantDocs = await vectorDB.search({
    vector: embedding,
    topK: 5
  });

  // 3. Generate answer with context
  const response = await generateText({
    model: openai('gpt-4-turbo'),
    prompt: `Answer based on these documents:

${relevantDocs.map(d =&gt; d.content).join('\n\n')}

Question: ${question}`
  });

  return {
    answer: response.text,
    sources: relevantDocs.map(d =&gt; d.metadata.url)
  };
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org7523152" class="outline-2">
<h2 id="org7523152">Part 5: Error Handling and UX</h2>
<div class="outline-text-2" id="text-org7523152">
</div>
<div id="outline-container-org6d6e972" class="outline-3">
<h3 id="org6d6e972">Rate Limiting</h3>
<div class="outline-text-3" id="text-org6d6e972">
</div>
<div id="outline-container-orgd49c5eb" class="outline-4">
<h4 id="orgd49c5eb">Protecting Your API</h4>
<div class="outline-text-4" id="text-orgd49c5eb">
<div class="org-src-container">
<pre class="src src-jsx">import { Ratelimit } from '@upstash/ratelimit';
import { Redis } from '@upstash/redis';

const ratelimit = new Ratelimit({
  redis: Redis.fromEnv(),
  limiter: Ratelimit.slidingWindow(10, '1 m') // 10 per minute
});

export async function POST(req: Request) {
  const ip = req.headers.get('x-forwarded-for') ?? 'anonymous';
  const { success, remaining } = await ratelimit.limit(ip);

  if (!success) {
    return new Response('Rate limited', {
      status: 429,
      headers: { 'X-RateLimit-Remaining': remaining.toString() }
    });
  }

  // Process AI request...
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2699de2" class="outline-3">
<h3 id="org2699de2">Graceful Degradation</h3>
<div class="outline-text-3" id="text-org2699de2">
</div>
<div id="outline-container-org167decc" class="outline-4">
<h4 id="org167decc">Handling Failures</h4>
<div class="outline-text-4" id="text-org167decc">
<div class="org-src-container">
<pre class="src src-jsx">function AIFeature() {
  const { error, isLoading, retry } = useChat({
    onError: (err) =&gt; {
      // Log to monitoring
      captureException(err);
    }
  });

  if (error) {
    return (
      &lt;div className="bg-yellow-50 p-4 rounded"&gt;
        &lt;p&gt;AI is temporarily unavailable.&lt;/p&gt;
        &lt;button onClick={retry}&gt;Try again&lt;/button&gt;
        &lt;p className="text-sm mt-2"&gt;
          You can still use the app manually.
        &lt;/p&gt;
      &lt;/div&gt;
    );
  }

  // Normal render...
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf7c98a5" class="outline-3">
<h3 id="orgf7c98a5">Cost Optimization</h3>
<div class="outline-text-3" id="text-orgf7c98a5">
</div>
<div id="outline-container-org20ced8e" class="outline-4">
<h4 id="org20ced8e">Strategies</h4>
<div class="outline-text-4" id="text-org20ced8e">
<ul class="org-ul">
<li>Cache common queries</li>
<li>Use smaller models for simple tasks</li>
<li>Implement token budgets per user</li>
<li>Stream responses (better UX, no change in cost)</li>
<li>Batch requests where possible</li>
<li>Monitor usage with observability tools</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org4c9352e" class="outline-2">
<h2 id="org4c9352e">Part 6: Responsible AI Integration</h2>
<div class="outline-text-2" id="text-org4c9352e">
</div>
<div id="outline-container-org9e490cd" class="outline-3">
<h3 id="org9e490cd">Content Moderation</h3>
<div class="outline-text-3" id="text-org9e490cd">
</div>
<div id="outline-container-org3ffe16e" class="outline-4">
<h4 id="org3ffe16e">Filtering Harmful Content</h4>
<div class="outline-text-4" id="text-org3ffe16e">
<div class="org-src-container">
<pre class="src src-jsx">import { generateText } from 'ai';
import { openai } from '@ai-sdk/openai';

async function moderatedGeneration(prompt: string) {
  // Pre-check user input
  const moderation = await openai.moderations.create({
    input: prompt
  });

  if (moderation.results[0].flagged) {
    throw new Error('Content policy violation');
  }

  // Safe to proceed
  const response = await generateText({
    model: openai('gpt-4-turbo'),
    prompt,
    // Also set system prompt for safety
    system: `You are a helpful assistant. Never provide
             harmful, illegal, or inappropriate content.`
  });

  return response;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org26712ea" class="outline-3">
<h3 id="org26712ea">Transparency with Users</h3>
<div class="outline-text-3" id="text-org26712ea">
</div>
<div id="outline-container-org679436c" class="outline-4">
<h4 id="org679436c">Best Practices</h4>
<div class="outline-text-4" id="text-org679436c">
<ul class="org-ul">
<li>Clearly label AI-generated content</li>
<li>Show confidence levels when appropriate</li>
<li>Allow users to provide feedback</li>
<li>Explain what data is used</li>
<li>Provide opt-out options</li>
<li>Document AI limitations</li>
</ul>
</div>
</div>
</div>
